{
  "backend/main.mo": "Defines the backend actor with player profiles, lobbies, tournaments, transactions, game state types, and storage mixins, serving as the core data model for the canister.",
  "feature_evidence.json": "Lists feature evidence for deploying draft build Version 163 to the live canister, including affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend source files describing their behavior, hooks, UI components, and game logic.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React application logic handling identity, admin checks, tabs, quick play flow, and routing between game, lobby, tournament, and wallet sections.",
  "frontend/src/components/AdminSettings.tsx": "UI for admin settings including live deployment status, system stats placeholders, and house‑cut configuration with nonfunctional backend hooks.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "Displays backend connectivity status using actor retry hook with connected, retrying, and error indicators.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal for deposits and withdrawals with Flexa integration, wallet checks, deposit polling, and status handling.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with branding and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Provides instructions and tips for publishing an app live on the Internet Computer, including link references.",
  "frontend/src/components/Header.tsx": "Displays the app header with logo, game mode selector, and wallet connection controls.",
  "frontend/src/components/LivePublishStatus.tsx": "Shows current site origin, public ICP link, and build metadata with copy and refresh actions.",
  "frontend/src/components/LobbyBrowser.tsx": "Lists game lobbies and offers quick‑play options for Spades and Omaha based on game mode.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder UI for lobby rooms, indicating the feature is under development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Prompts users to create a profile for online or offline mode, saving data locally or via backend.",
  "frontend/src/components/QuickPlayGame.tsx": "Runs quick‑play sessions for Spades or Omaha, handling state, actions, and game rendering.",
  "frontend/src/components/spades/SpadesScoreboard.tsx": "Renders compact or full scoreboard for Spades, showing scores, penalties, and hand info.",
  "frontend/src/components/TournamentSection.tsx": "Displays tournament info with badges and descriptions that change based on game mode.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides WalletConnect flow with URI generation, copying, deep links, QR code, and error handling.",
  "frontend/src/components/WalletInstallModal.tsx": "Shows a modal prompting users to install a browser wallet with quick links to Coinbase Wallet and MetaMask.",
  "frontend/src/components/WalletPickerModal.tsx": "Lets users choose a wallet type or guest mode, handles connection attempts, and shows errors.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet stats, balances, transactions, and deposit/withdraw controls depending on game mode.",
  "frontend/src/contexts/Web3WalletContext.tsx": "Provides global Web3 wallet state and actions via React context using useWeb3Wallet.",
  "frontend/src/games/omaha/bots.ts": "Implements a simple Omaha bot decision system choosing between check, bet, call, or fold based on game state and randomness.",
  "frontend/src/games/omaha/engine.ts": "Provides Omaha game logic including deck creation, shuffling, hand initialization, hand rotation, and action validation like checking and calling.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by testing all valid 5‑card combinations and ranking them, including straight/flush detection and tiebreakers.",
  "frontend/src/games/omaha/OmahaCommunityBoard.tsx": "Renders a 5-slot community card board for Omaha, revealing cards based on the current street and showing placeholders or a fallback message if cards are missing.",
  "frontend/src/games/omaha/types.ts": "Defines Omaha-related types such as cards, players, game state, and helper functions for card formatting and suit color.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages unified game session flow for Spades and Omaha, handling user actions, bot turns, and hand transitions.",
  "frontend/src/games/spades/bots.ts": "Implements basic Spades bot logic for choosing bids and selecting legal, generally low-value cards to play.",
  "frontend/src/games/spades/engine.ts": "Contains core Spades game mechanics including deck handling, dealing, bidding, turn flow, trick resolution, and restarting hands.",
  "frontend/src/games/spades/scoring.ts": "Defines Spades scoring rules, nil handling, target score checks, and winner determination based on total scores.",
  "frontend/src/games/spades/types.ts": "Defines Spades card, player, trick, and game state types plus helpers for suit symbols and card formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection state, retry tracking, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity, handling auth client creation, login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, canister build metadata, and Flexa deposit operations using the backend actor.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages local quick‑play game sessions, including bot automation, bidding, and card play for Spades and Omaha.",
  "frontend/src/hooks/useWalletConnect.ts": "Handles WalletConnect session lifecycle, connection flow, errors, and balance retrieval.",
  "frontend/src/hooks/useWeb3Wallet.ts": "React hook managing Web3 wallet state, detection, connection flows, WalletConnect sync, and guest wallet generation.",
  "frontend/src/index.css": "Tailwind base setup with custom themes, gradients, card styles, scrollbar styling, and dark mode variables.",
  "frontend/src/lib/walletconnect.ts": "Custom WalletConnect client wrapper handling initialization, connection, session management, requests, and disconnect logic.",
  "frontend/src/lib/web3modal.ts": "Defines Base chain metadata and placeholder config for future Web3Modal integration.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the root component.",
  "frontend/src/utils/icpLinks.ts": "Utility functions for resolving canister IDs, generating IC links, and clipboard copying.",
  "frontend/src/utils/sleep.ts": "Simple promise-based sleep utility for delaying async actions.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Metadata describing the project state, including schema version, features, and tracking information for deployment of a draft build to a live canister."
}