{
  "backend/main.mo": "Defines core Motoko types for users, lobbies, tournaments, transactions, gameplay states, and includes blob storage mixin but truncates before logic.",
  "feature_evidence.json": "Feature evidence report stub with an empty feature list.",
  "frontend-file-summaries.txt": "Lists frontend file summaries describing hooks, components, wallet logic, styling, and placeholders.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app wrapper managing tabs, wallet auto-connect, admin checks, quick play routing, and theme/query providers.",
  "frontend/src/components/AdminSettings.tsx": "Admin dashboard letting admins view system stats and update house cut percentage.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "Badge component showing backend connection status with retry/error tooltips.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal for deposits and withdrawals with Flexa payment flow, polling, validation, and wallet integration.",
  "frontend/src/components/Footer.tsx": "Simple footer with branding and caffeine.ai attribution.",
  "frontend/src/components/GoLiveHelp.tsx": "Provides a help card explaining how to publish an app live on the Internet Computer, including draft vs live workflows and ICP gateway link info.",
  "frontend/src/components/Header.tsx": "Renders the main app header with wallet connection, game mode toggle, backend status, and deposit/withdraw modals.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin, ICP public link, and build metadata with clipboard copy actions.",
  "frontend/src/components/LobbyBrowser.tsx": "Shows lobby browsing placeholders and provides Quick Play buttons for Spades or Omaha against AI.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder component for future multiplayer lobby rooms.",
  "frontend/src/components/ProfileSetupModal.tsx": "Handles creating user profiles in real or fun mode, generating guest addresses, and saving profile data to backend or local storage.",
  "frontend/src/components/QuickPlayGame.tsx": "Displays a basic game screen for Spades or Omaha with an exit button and a placeholder for upcoming gameplay UI.",
  "frontend/src/components/TournamentSection.tsx": "Shows a tournaments overview with badges and descriptions, indicating features coming soon for both real and fun modes.",
  "frontend/src/components/WalletConnectModal.tsx": "Modal for connecting via WalletConnect, offering QR scanning or mobile deep links and copy-to-clipboard URI support.",
  "frontend/src/components/WalletInstallModal.tsx": "Modal prompting users to install a browser wallet, providing links to Coinbase Wallet and MetaMask.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet stats, balance, transactions, and supports deposit/withdraw modals for real or fun modes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection state, retry tracking, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as profiles, lobbies, and metadata.",
  "frontend/src/hooks/useWeb3Wallet.ts": "React hook managing Web3 wallet state, guest wallet generation, balance fetching, provider detection, and connection logic for injected wallets.",
  "frontend/src/index.css": "Tailwind base and utility layers defining OKLCH-themed colors, animations, gradients, and custom UI styles.",
  "frontend/src/lib/web3modal.ts": "Defines Base chain metadata and placeholders for future Web3Modal integration without active wallet logic.",
  "frontend/src/main.tsx": "React entry point initializing QueryClient, Internet Identity context, and rendering the App.",
  "frontend/src/utils/icpLinks.ts": "Utilities for detecting canister IDs, generating IC public links, and handling clipboard operations.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading/storing URL parameters and session values, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, and typography using OKLCH variables and plugins.",
  "project_state.json": "Project metadata describing Crypto Cards architecture, frontend/backend integration, and known issues."
}