{
  "backend/main.mo": "Defines the backend actor with all game, lobby, tournament, wallet, stats, and player profile types, including Omaha and Spades game state structures.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for major frontend files describing hooks, components, UI behavior, and game logic.",
  "frontend/index.html": "Basic HTML entry file mounting the React app at the root element and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app controller handling identity, actor loading, admin checks, game mode, quick play routing, and global modals (wallet connect/install).",
  "frontend/src/components/AdminSettings.tsx": "Admin dashboard for updating house cut and viewing live system stats with validation, API calls, and toast feedback.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI badge showing backend connectivity status using actor retry logic, with tooltips for errors and reconnect attempts.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal for depositing or withdrawing funds with Flexa payment flow, balance polling, and wallet integration.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright info and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Help card explaining how to publish an app live on the Internet Computer and where to find public links.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling authentication, wallet connections, mode switching, and deposit/withdraw modals.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin, public ICP link, and build metadata with copy-to-clipboard actions.",
  "frontend/src/components/LobbyBrowser.tsx": "UI for browsing or quick‑playing game lobbies, with placeholders for upcoming multiplayer features.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder component for future multiplayer lobby room functionality.",
  "frontend/src/components/ProfileSetupModal.tsx": "Handles user profile creation for online and offline modes, generating guest wallets and saving profiles locally or via API.",
  "frontend/src/components/QuickPlayGame.tsx": "Runs quick-play Spades or Omaha games, initializing sessions and rendering the correct game component with player actions.",
  "frontend/src/components/TournamentSection.tsx": "Displays a placeholder tournaments section with different descriptions and badges depending on game mode.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides a modal for connecting via WalletConnect, offering QR codes or mobile deep-links and copy-to-clipboard URI support.",
  "frontend/src/components/WalletInstallModal.tsx": "Shows a modal prompting users to install a Web3 wallet, linking to Coinbase Wallet and MetaMask.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet info, balance, transactions, and player stats for both online and offline modes, with deposit and withdraw modals.",
  "frontend/src/contexts/Web3WalletContext.tsx": "Defines a context wrapping Web3 wallet state and actions, exposing connection status and utility functions to the app.",
  "frontend/src/games/omaha/bots.ts": "Provides a simple Omaha bot that chooses fold, check, call, or bet based on current state and randomness.",
  "frontend/src/games/omaha/engine.ts": "Implements Omaha game setup, deck creation, shuffling, dealing, action validation, and action execution.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by checking all valid 5‑card combinations and ranking them for winner determination.",
  "frontend/src/games/omaha/OmahaCommunityBoard.tsx": "Renders five community card slots, revealing cards based on the current street and showing fallback text if missing.",
  "frontend/src/games/omaha/types.ts": "Defines Omaha card, player, and game state types plus helpers for card formatting and suit coloring.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages creation of Spades or Omaha sessions and executes player or bot actions for each game type.",
  "frontend/src/games/spades/bots.ts": "Implements simple Spades bot logic for selecting bids and choosing legal cards to play.",
  "frontend/src/games/spades/engine.ts": "Handles Spades game initialization, deck operations, bidding, card play, trick flow, and hand progression.",
  "frontend/src/games/spades/scoring.ts": "Defines scoring rules for Spades, checks target score, and determines the winning player.",
  "frontend/src/games/spades/types.ts": "Defines core Spades types including cards, players, game state, and helpers for suit symbols and colors.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with error handling and retry state to track connectivity and provide friendly error messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data such as profiles, lobbies, tournaments, and metadata using actor retries.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages quick‑play game sessions with bot action processing, bid submission, and card play handling for Spades and Omaha.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Implements Web3 wallet detection, connection, balance fetching, guest wallets, and transaction readiness logic.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, dark mode values, utility classes, scrollbar styling, and custom playing-card visuals.",
  "frontend/src/lib/web3modal.ts": "Exports Base chain config, app metadata, and a placeholder null Web3Modal object for future wallet integration.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/icpLinks.ts": "Provides helpers to detect canister IDs, build IC gateway URLs, and copy text to clipboard with error handling.",
  "frontend/src/utils/sleep.ts": "Simple promise-based sleep helper for delaying async actions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color variables, animations, and plugin usage.",
  "project_state.json": "Tracks project metadata, known issues, and feature requirements related to wallet connection UX fixes."
}