{
  "backend/main.mo": "Defines the main canister with extensive type structures for lobbies, tournaments, player stats, transactions, game states, and storage mixins but with logic omitted/truncated.",
  "feature_evidence.json": "Feature evidence report linking a UI background gradient enhancement to affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Mapping of frontend source file paths to short descriptive summaries of their functionality for build and planning use.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wiring providers, authentication, admin check, quick‑play routing, and tabbed navigation within a colorful gradient layout.",
  "frontend/src/components/AdminSettings.tsx": "Admin settings UI with placeholders for future backend house‑cut updates and system statistics.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "Badge-based indicator showing backend connection status with retry feedback using useActorWithRetry.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal handling deposits and withdrawals, including Flexa deposit initiation, polling, status tracking, and wallet readiness checks.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Help card explaining how to publish an app live on ICP and where to find public links.",
  "frontend/src/components/Header.tsx": "Top navigation bar with game mode controls, wallet connect/disconnect, and deposit/withdraw modal triggers.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin, ICP public link, and build metadata with copy-to-clipboard actions.",
  "frontend/src/components/LobbyBrowser.tsx": "UI for browsing lobbies and starting quick-play games, with matchmaking features marked as coming soon.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room component showing that multiplayer rooms are under development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating user profiles for online or offline play, handling username input, wallet/guest address setup, and saving profile data.",
  "frontend/src/components/QuickPlayGame.tsx": "Wrapper component that initializes and manages quick-play sessions for Spades or Omaha, rendering the appropriate game UI and handling exits.",
  "frontend/src/components/spades/SpadesScoreboard.tsx": "Displays Spades scores, penalties, and hand info in compact or full layouts with optional sticky positioning.",
  "frontend/src/components/TournamentSection.tsx": "Static UI section displaying upcoming tournament features with different messaging for real-play and offline modes.",
  "frontend/src/components/WalletConnectModal.tsx": "Modal for establishing a WalletConnect session, supporting QR codes, deep links, error handling, and auto-closing on success.",
  "frontend/src/components/WalletInstallModal.tsx": "Modal prompting users to install a browser wallet extension with direct links to recommended wallets.",
  "frontend/src/components/WalletPickerModal.tsx": "Modal allowing users to choose a wallet provider or guest mode, invoking connection logic and handling errors.",
  "frontend/src/components/WalletSection.tsx": "Renders wallet and player stats, handling offline and on‑chain modes with balance, winnings, transactions, and deposit/withdraw modals.",
  "frontend/src/contexts/Web3WalletContext.tsx": "Provides a React context exposing Web3 wallet connection state, actions, and availability checks.",
  "frontend/src/games/omaha/bots.ts": "Implements a simple randomized bot decision algorithm using basic checking, calling, betting, and folding logic.",
  "frontend/src/games/omaha/engine.ts": "Implements deck creation, shuffling, hand initialization, hand rotation, and core Omaha action rules and validation.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by checking all valid combinations and ranks five‑card hands to determine winners.",
  "frontend/src/games/omaha/OmahaCommunityBoard.tsx": "Shows Omaha community cards based on the current street with fallback messaging when cards are missing.",
  "frontend/src/games/omaha/types.ts": "Defines core Omaha types including cards, players, game state, and helpers for card formatting and suit color.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages creation and progression of quick-play sessions for Spades and Omaha, routing player and bot actions to the correct engine.",
  "frontend/src/games/spades/bots.ts": "Implements simple Spades bot logic for picking bids and choosing which card to play based on lead suit and legality.",
  "frontend/src/games/spades/engine.ts": "Handles Spades game initialization, deck management, hand dealing, bidding, and trick progression with scoring integration.",
  "frontend/src/games/spades/scoring.ts": "Defines scoring rules for Spades hands and utilities for checking target score and determining winners.",
  "frontend/src/games/spades/types.ts": "Provides TypeScript types for Spades cards, players, tricks, game state, and helpers for card display formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection state tracking, retry detection, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and helpers for managing Internet Identity authentication and exposing identity state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, canister build metadata, and Flexa deposit actions with mutation‑based updates and polling.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages quick‑play game sessions including bot turn processing, game start, bidding, and card play logic.",
  "frontend/src/hooks/useWalletConnect.ts": "Handles WalletConnect client initialization, connection flow, session state, errors, and balance queries.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Unified web3 wallet manager supporting injected wallets, WalletConnect, and guest mode with address, chain, and connection state.",
  "frontend/src/index.css": "Tailwind‑based global styles defining light/dark themes, gradients, scrollbars, and playing card UI styling.",
  "frontend/src/lib/walletconnect.ts": "Implements a dynamic WalletConnect client for initializing, connecting, managing sessions, and sending requests.",
  "frontend/src/lib/web3modal.ts": "Defines Base chain metadata and placeholders for future Web3Modal integration.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/utils/icpLinks.ts": "Provides helpers for detecting canister IDs, generating IC links, and copying text to clipboard.",
  "frontend/src/utils/sleep.ts": "Exports a simple promise-based sleep utility.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins.",
  "project_state.json": "Tracks project metadata, features, and pending requests."
}