{
  "backend/main.mo": "Defines the main canister actor with storage mixin, user profiles, lobbies, tournaments, gameplay state types, transactions, admin stats, and various game-related data structures.",
  "feature_evidence.json": "Feature evidence report mapping UI features to source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend hooks and components across the app.",
  "frontend/index.html": "Base HTML file loading the root div and main TypeScript entrypoint for the frontend.",
  "frontend/src/App.tsx": "Main React app component handling tabs, game modes, wallet integration, admin checks, quick play flow, and layout.",
  "frontend/src/components/AdminSettings.tsx": "Admin dashboard UI for viewing platform stats and updating the house cut percentage with validation and toast feedback.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI badge showing backend connection status with retry feedback and detailed tooltip messages.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal handling deposit and withdrawal flows with Flexa support, wallet interactions, and status polling.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Help card explaining how to publish an app live on the Internet Computer and where to find public links.",
  "frontend/src/components/Header.tsx": "Header showing game mode toggle, wallet connection controls, and deposit/withdraw modals.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays build metadata along with current site origin and public ICP link, with copy-to-clipboard actions.",
  "frontend/src/components/LobbyBrowser.tsx": "UI for browsing lobbies and starting quick-play games, with a notice about upcoming multiplayer features.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room card indicating multiplayer lobby rooms are under development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or saving user profiles in real or fun mode, integrating wallet and local storage.",
  "frontend/src/components/QuickPlayGame.tsx": "Displays a placeholder interface for Spades or Omaha quick-play mode with exit controls and a coming-soon alert.",
  "frontend/src/components/TournamentSection.tsx": "Renders a tournaments preview card showing upcoming tournament features with mode-specific badges and descriptions.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides a modal for WalletConnect linking, including QR flow on desktop and deep links for mobile wallets with copy-to-clipboard support.",
  "frontend/src/components/WalletInstallModal.tsx": "Shows a modal prompting users to install a browser wallet, offering links to Coinbase Wallet and MetaMask.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet balances, stats, and transaction history for real or offline modes and manages deposit/withdraw modals.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, auto-refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection status, retry tracking, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend canister actors and fetching or mutating user, lobby, tournament, and admin data.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Implements a Web3 wallet hook supporting injected wallets or guest sessions, handling connection, balance fetching, chain checks, and transaction readiness.",
  "frontend/src/index.css": "Tailwind CSS setup with custom themes, animations, scrollbar styles, and interactive element enhancements.",
  "frontend/src/lib/web3modal.ts": "Contains placeholder Web3Modal configuration and metadata for Base chain and app branding.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering React root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/icpLinks.ts": "Utility functions for determining canister IDs, generating public IC URLs, and copying text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH color tokens, extended animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing a crypto card-game dApp with React/Tailwind frontend, IC canister backend, payment integrations, architectural notes, and known implementation gaps."
}