{
  "backend/main.mo": "Defines actor types and data models for lobbies, tournaments, player stats, transactions, bidding, and Omaha game state, including storage mixins and access control imports.",
  "feature_evidence.json": "Lists feature evidence entries mapping Spades game rule updates to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of each frontend file, including hooks, components, styles, and game UI logic.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app container managing authentication, tabs, admin checks, and launching Quick Play games.",
  "frontend/src/components/AdminSettings.tsx": "Admin panel for viewing platform stats and updating house cut percentage with validation and live feedback.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI indicator showing backend connection status with retry feedback and detailed tooltip messages.",
  "frontend/src/components/DepositWithdrawModal.tsx": "A modal handling deposits and withdrawals, including Flexa-based payment flow, polling, validation, and wallet interactions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with attribution and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Provides explanatory UI about publishing an app live on the Internet Computer, including steps and link info.",
  "frontend/src/components/Header.tsx": "Top navigation bar showing game title, mode toggle, wallet connection options, and deposit/withdraw modals.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin and ICP link with metadata, plus copy-to-clipboard controls and build info.",
  "frontend/src/components/LobbyBrowser.tsx": "Shows game lobby overview, a notice about upcoming features, and quick-play options for Spades and Omaha.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room UI indicating multiplayer room features are in development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that initializes and saves user profiles for real or offline play, generating guest wallets and handling backend or local storage saves.",
  "frontend/src/components/QuickPlayGame.tsx": "Component that starts and manages quick-play Spades or Omaha sessions, rendering the appropriate game UI and handling gameplay actions.",
  "frontend/src/components/TournamentSection.tsx": "UI section displaying upcoming tournament mode information, with messaging adjusted based on real or fun game mode.",
  "frontend/src/components/WalletConnectModal.tsx": "Modal providing WalletConnect QR or deep links for mobile wallets, including copy-to-clipboard and wallet app launch actions.",
  "frontend/src/components/WalletInstallModal.tsx": "Modal prompting users to install a browser wallet like Coinbase Wallet or MetaMask when none is detected.",
  "frontend/src/components/WalletSection.tsx": "Wallet dashboard showing balance, winnings, and transaction history for online or offline mode, with deposit/withdraw controls.",
  "frontend/src/games/omaha/bots.ts": "Simple Omaha bot logic that chooses fold, check, call, or bet actions based on allowed moves and random probability.",
  "frontend/src/games/omaha/engine.ts": "Implements Omaha game logic including deck creation, shuffling, game initialization, player actions, and betting flow.",
  "frontend/src/games/omaha/handEvaluator.ts": "Provides Omaha hand evaluation by testing all 2+3 card combos and ranking five‑card hands.",
  "frontend/src/games/omaha/types.ts": "Defines core Omaha types including cards, players, game state, and helper formatting functions.",
  "frontend/src/games/session/quickPlaySession.ts": "Creates and manages quick-play sessions for Spades or Omaha, routing actions to the correct game engine and handling bot turns.",
  "frontend/src/games/spades/bots.ts": "Contains simple bot logic for Spades bidding and card selection based on legality and heuristics.",
  "frontend/src/games/spades/engine.ts": "Implements Spades game logic including deck handling, dealing, bidding, trick play, and hand reset.",
  "frontend/src/games/spades/scoring.ts": "Implements Spades scoring rules, target detection, and winner determination based on total scores.",
  "frontend/src/games/spades/types.ts": "Defines Spades types such as cards, players, trick structure, game state, and helper card formatting.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Tracks actor loading with retry, connection, and error states using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for backend calls using an actor, plus shared frontend game and profile types.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages local quick‑play game sessions, handling player actions and paced bot actions.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Implements Web3 wallet detection, connection, balance fetching, and guest wallet support.",
  "frontend/src/index.css": "Tailwind‑based global styles with theme variables, animations, utilities, and custom UI elements.",
  "frontend/src/lib/web3modal.ts": "Contains Base chain metadata and placeholders for future Web3Modal integration.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, and the InternetIdentityProvider before rendering App.",
  "frontend/src/utils/icpLinks.ts": "Helpers for resolving the IC canister ID, generating IC gateway links, and copying text to the clipboard.",
  "frontend/src/utils/sleep.ts": "Provides a simple promise-based sleep function.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, themes, animations, and plugins.",
  "project_state.json": "Project state metadata describing Spades scoring features, issues, and pending requests."
}