{
  "backend/main.mo": "Defines the backend actor with storage mixin and extensive type definitions for players, lobbies, tournaments, transactions, game states, and admin stats.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature IDs to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains generated summaries of various frontend files describing their roles, behaviors, and recent fixes.",
  "frontend/index.html": "Basic HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app handling game modes, wallet initialization, admin checks, quick‑play flow, and tabbed navigation.",
  "frontend/src/components/AdminSettings.tsx": "Admin dashboard for viewing platform stats and updating the house cut percentage with validation and feedback.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI badge showing backend connection, retry attempts, and error details using useActorWithRetry.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal handling deposit and withdrawal flows, including Flexa payment status polling, wallet interactions, and form validation.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with wallet connect, mode toggle, deposit/withdraw controls, and branding.",
  "frontend/src/components/LivePublishStatus.tsx": "Card showing live app URL and backend build metadata with copy-to-clipboard and loading/error states.",
  "frontend/src/components/LobbyBrowser.tsx": "Lobby overview with placeholder alerts and Quick Play buttons for Spades and Omaha.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room card indicating multiplayer features are under development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to create a profile based on game mode, handling both online and offline profile creation.",
  "frontend/src/components/QuickPlayGame.tsx": "Basic game screen wrapper showing title, mode, exit button, and a placeholder game interface.",
  "frontend/src/components/TournamentSection.tsx": "Displays a tournaments section with dynamic text and badges based on game mode and placeholder content for upcoming tournament features.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides a modal for WalletConnect integration with mobile detection, QR/URI copy, and deep links to major wallets.",
  "frontend/src/components/WalletInstallModal.tsx": "Shows a modal prompting users to install a Web3 wallet, offering links to Coinbase Wallet and MetaMask extensions.",
  "frontend/src/components/WalletSection.tsx": "Renders wallet stats, balances, and transaction history for online or offline modes with modals for deposits and withdrawals.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with retry, error detection, and connection status tracking for backend connectivity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous frontend data types and React Query hooks for fetching and mutating canister data such as user profiles and build metadata.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Implements a Web3 wallet hook handling wallet detection, connection, balance fetching, chain switching, and guest wallet generation.",
  "frontend/src/index.css": "Provides Tailwind base styles, theme variables, animations, and custom UI utilities including gradients, scrollbars, and button effects.",
  "frontend/src/lib/web3modal.ts": "Contains placeholder Web3Modal integration setup with Base chain metadata and app wallet metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and container settings with OKLCH-based design tokens.",
  "project_state.json": "Defines the overall dApp state, including frontend architecture, backend canister design, payment integrations, and known limitations. Captures React/IC integration patterns, dual offline/online modes, and unresolved implementation gaps across lobbies, payments, and gameplay."
}