{
  "backend/main.mo": "Defines the actor’s data models for lobbies, tournaments, players, transactions, bidding state, Omaha game state, admin stats, and related types.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of various frontend hooks, components, and styles.",
  "frontend/index.html": "Root HTML document loading the app and mounting the React entry point.",
  "frontend/src/App.tsx": "Main application shell handling tabs, authentication, admin checks, user profile loading, and Quick Play game mounting.",
  "frontend/src/components/AdminSettings.tsx": "Admin panel for viewing system stats and updating the house cut percentage with validation and toast notifications.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI indicator showing backend connection status using actor retry logic with tooltips for detailed status messages.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal handling deposits and withdrawals, including Flexa payment flow, wallet actions, and real-time status polling. Manages input validation, success/error states, and UI transitions.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Card explaining how to publish an app live on the Internet Computer and providing tips about URLs and access. Includes guidance on draft, publish, and public ICP links.",
  "frontend/src/components/Header.tsx": "App header with branding, mode toggle, wallet connection controls, and deposit/withdraw modals. Integrates wallet providers and backend connectivity indicator.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin and ICP public link with copy-to-clipboard actions. Shows build metadata and handles copy success feedback.",
  "frontend/src/components/LobbyBrowser.tsx": "Lobby browser UI with a placeholder alert and quick-play options for Spades and Omaha. Supports switching based on game mode.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room component showing a 'coming soon' alert for multiplayer rooms.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal for creating user profiles in real or offline mode and saves profile data to backend or local storage.",
  "frontend/src/components/QuickPlayGame.tsx": "Initializes and renders quick-play Spades or Omaha games, handling game state, actions, and exit behavior.",
  "frontend/src/components/TournamentSection.tsx": "Shows a placeholder tournaments section with mode‑dependent descriptions and badges.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides a modal for connecting via WalletConnect, offering QR codes or mobile deep links and copy‑to‑clipboard support.",
  "frontend/src/components/WalletInstallModal.tsx": "Prompts users to install a Web3 wallet extension and links to Coinbase Wallet and MetaMask downloads.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet balances, stats, and transaction history for real or offline mode and supports deposit/withdraw actions.",
  "frontend/src/games/omaha/bots.ts": "Implements a simple AI decision system for Omaha bots based on check, call, bet, or fold conditions.",
  "frontend/src/games/omaha/engine.ts": "Implements Omaha game logic including deck creation, shuffling, dealing, betting actions, and turn progression.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by testing all valid 5‑card combos and ranks them to determine winners.",
  "frontend/src/games/omaha/types.ts": "Defines Omaha-specific card, player, and game state types plus helpers for displaying suits.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages unified play sessions for Spades and Omaha, initializing games and routing actions with bot logic.",
  "frontend/src/games/spades/bots.ts": "Provides simple Spades bot logic that selects the lowest legal playable card.",
  "frontend/src/games/spades/engine.ts": "Implements Spades rules including deck handling, card validation, trick flow, and determining trick winners.",
  "frontend/src/games/spades/types.ts": "Defines Spades-specific card, player, trick, and game state types with display helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection state tracking, error handling, and retry awareness.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider to manage Internet Identity authentication, including login, logout, and loading persisted identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, canister metadata, and game-related entities.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages local quick-play game sessions, handling starting games, executing actions, and resetting session state with error toasts.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Implements Web3 wallet detection, connection, balance fetching, chain switching, and guest wallet generation with stateful React logic.",
  "frontend/src/index.css": "Defines global Tailwind styles, custom CSS variables, animations, UI utilities, and themed components like cards and tables.",
  "frontend/src/lib/web3modal.ts": "Provides chain metadata and placeholders for future WalletConnect/Web3Modal integration.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering the root component.",
  "frontend/src/utils/icpLinks.ts": "Utility functions for resolving the current canister ID, generating IC gateway links, and copying text to the clipboard.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including from hash), persist them in sessionStorage, and clear them from session or the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration defining color tokens, layout settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing project state, known issues, and existing feature requirements for fixing UI regressions and Quick Play game functionality."
}