{
  "backend/main.mo": "Defines actor types and structures for lobbies, tournaments, user profiles, transactions, and game states using AccessControl, storage mixins, and various Motoko core modules.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten one‑sentence summaries describing the purpose and behavior of various frontend hooks, components, and styles.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main application shell handling authentication, admin checks, game mode selection, navigation tabs, and quick‑play flow within a React Query–powered layout.",
  "frontend/src/components/AdminSettings.tsx": "Admin settings panel with placeholders for house‑cut configuration, system statistics, and live deployment status helpers.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI badge showing backend connectivity status using useActorWithRetry, with tooltips for connection, retry, and error states.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal for handling deposit and future withdrawal actions, validating wallet state and initiating Flexa deposits with status polling.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "Provides guidance on publishing an app live on the Internet Computer, including links and deployment explanations.",
  "frontend/src/components/Header.tsx": "Header with game mode selection and wallet connection controls, including deposit and withdrawal modals.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin, public ICP link, and canister build metadata with copy and refresh actions.",
  "frontend/src/components/LobbyBrowser.tsx": "UI for browsing lobbies and launching quick-play games for Spades or Omaha.",
  "frontend/src/components/LobbyRoom.tsx": "Placeholder lobby room component indicating multiplayer features are under development.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating player profiles for online or offline modes, saving data to backend or local storage.",
  "frontend/src/components/QuickPlayGame.tsx": "Main wrapper that initializes and renders either a Spades or Omaha quick‑play session using session state and gameplay handlers.",
  "frontend/src/components/spades/SpadesScoreboard.tsx": "React scoreboard component for Spades showing player scores, penalties, and compact/full views with optional sticky layout.",
  "frontend/src/components/TournamentSection.tsx": "Displays tournament information and UI badges, adjusting messaging based on game mode (forFun or forReal).",
  "frontend/src/components/WalletConnectModal.tsx": "Modal for connecting via WalletConnect, showing QR codes, deep links, errors, and connection status.",
  "frontend/src/components/WalletInstallModal.tsx": "Prompts users to install a browser wallet like Coinbase or MetaMask when none is detected.",
  "frontend/src/components/WalletPickerModal.tsx": "Modal allowing users to choose a wallet type (Coinbase, MetaMask, WalletConnect, or guest) and initiate connection.",
  "frontend/src/components/WalletSection.tsx": "Wallet management panel for real‑money mode, handling network checks, balances, and deposit/withdraw flows based on connection state.",
  "frontend/src/contexts/Web3WalletContext.tsx": "Provides a React context wrapper for wallet connection state and exposes methods from useWeb3Wallet.",
  "frontend/src/games/omaha/bots.ts": "Implements simple Omaha bot behavior choosing between check, bet, call, or fold based on game state.",
  "frontend/src/games/omaha/engine.ts": "Defines Omaha game initialization, deck creation, shuffling, hand progression, and action validation functions.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by checking all valid card combinations and ranking five‑card hands with tiebreakers.",
  "frontend/src/games/omaha/OmahaCommunityBoard.tsx": "Displays Omaha community cards with reveal logic based on betting street and fallback when cards are missing.",
  "frontend/src/games/omaha/types.ts": "Contains type definitions for Omaha cards, players, game state, and helper functions for card text and suit color.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages quick‑play sessions for Spades and Omaha, routing actions and bot turns to the appropriate engine.",
  "frontend/src/games/spades/bots.ts": "Implements basic Spades bot logic for selecting legal cards and generating bidding heuristics.",
  "frontend/src/games/spades/engine.ts": "Implements Spades game setup, including deck creation, shuffling, dealing, bidding, and starting new hands.",
  "frontend/src/games/spades/scoring.ts": "Provides scoring logic for Spades, including hand scoring, target checks, and winner determination.",
  "frontend/src/games/spades/types.ts": "Defines core Spades types for cards, players, tricks, penalties, and game state utilities.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using identity, refreshing dependent queries on actor changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with retry, connection state tracking, and user-friendly error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, providing login, logout, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for user profiles, build metadata, and Flexa deposit operations using the backend actor.",
  "frontend/src/hooks/useQuickPlaySession.ts": "Manages quick-play game sessions, handling bot actions, bidding, and card play with async processing and state updates.",
  "frontend/src/hooks/useWalletConnect.ts": "Implements WalletConnect lifecycle including initialization, connection, approval, disconnection, and error handling.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Provides unified Web3 wallet management across injected wallets, WalletConnect, and a guest wallet, syncing state and balances.",
  "frontend/src/index.css": "Defines Tailwind layers, theme variables, gradients, scrollbar styling, and custom card UI styles.",
  "frontend/src/lib/walletconnect.ts": "Wraps WalletConnect SignClient to initialize, connect, manage sessions, disconnect, and send requests.",
  "frontend/src/lib/web3modal.ts": "Contains Base chain config and metadata with a placeholder for future Web3Modal integration.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/types/qrcode.d.ts": "Empty declaration file reserved for QR code type definitions.",
  "frontend/src/utils/ethFormat.ts": "Provides BigInt‑safe utilities to parse wei to ETH and format ETH balances.",
  "frontend/src/utils/icpLinks.ts": "Provides utilities to detect the current canister ID from various sources, build IC gateway URLs, get site origin, and copy text to the clipboard.",
  "frontend/src/utils/sleep.ts": "Implements a simple Promise-based sleep function for delaying async actions.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS themes, colors, animations, and plugins including typography, container queries, and animations.",
  "project_state.json": "Tracks project state, issues, features, and deployment concerns for the multiplayer crypto gambling card game."
}