{
  "backend/main.mo": "Defines actor types for lobbies, tournaments, players, transactions, and Omaha/Spades game state, using various core and storage modules.",
  "feature_evidence.json": "Lists feature evidence entries linking wallet‑related fixes to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing hooks, components, styles, and wallet/game logic.",
  "frontend/index.html": "Basic HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app shell handling identity, admin checks, profile setup, routing via tabs, and game launching with Web3 wallet context.",
  "frontend/src/components/AdminSettings.tsx": "Admin panel UI with live publish status, placeholder system stats, and house‑cut configuration awaiting backend support.",
  "frontend/src/components/BackendConnectivityIndicator.tsx": "UI badge showing backend connectivity status with retry feedback using useActorWithRetry.",
  "frontend/src/components/DepositWithdrawModal.tsx": "Modal handling deposits via Web3 wallet, including validation, status polling, and initiating Flexa deposit intents.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/GoLiveHelp.tsx": "UI card explaining how to publish an app live on the Internet Computer and where to find ICP gateway links.",
  "frontend/src/components/Header.tsx": "App header with game mode selection and wallet controls, including connect, disconnect, deposit, and withdraw options.",
  "frontend/src/components/LivePublishStatus.tsx": "Displays current site origin, ICP public link, and build metadata with copy and refresh actions.",
  "frontend/src/components/LobbyBrowser.tsx": "Lobby selection interface offering Quick Play options for Spades and Omaha depending on game mode.",
  "frontend/src/components/LobbyRoom.tsx": "Stub lobby room component showing a placeholder message for under‑development multiplayer rooms.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting users to create a profile, supporting both online (IC) and offline modes with local or backend storage.",
  "frontend/src/components/QuickPlayGame.tsx": "Manages quick-play sessions for Spades or Omaha, initializing games and rendering the appropriate game UI. Includes embedded Spades game logic for bidding, card play, and trick display.",
  "frontend/src/components/spades/SpadesScoreboard.tsx": "Renders a Spades scoreboard in compact or full mode, showing scores, last-hand changes, and reneging penalties.",
  "frontend/src/components/TournamentSection.tsx": "Displays a tournaments overview with badges and descriptive text, adapting content based on whether the user is in for-fun or for-real mode.",
  "frontend/src/components/WalletConnectModal.tsx": "Provides a WalletConnect connection modal with QR code generation, deep links, error handling, and embedded-browser warnings.",
  "frontend/src/components/WalletInstallModal.tsx": "Shows a modal prompting users to install a browser wallet, offering links to Coinbase Wallet and MetaMask with guidance for setup.",
  "frontend/src/components/WalletPickerModal.tsx": "Allows users to choose a wallet type to connect, handling connection attempts, errors, and available wallet options.",
  "frontend/src/components/WalletSection.tsx": "Displays wallet status, connection flow, errors, and options to open picker or deposit/withdraw, with special handling for embedded browsers.",
  "frontend/src/contexts/Web3WalletContext.tsx": "Provides a React context for Web3 wallet state and actions, exposing connection, network, and wallet management functions.",
  "frontend/src/games/omaha/bots.ts": "Implements simple Omaha bot logic choosing fold, check, call, or bet actions based on basic probabilities and game state.",
  "frontend/src/games/omaha/engine.ts": "Defines Omaha game setup, deck creation, shuffling, hand initialization, and basic action rules like check and call.",
  "frontend/src/games/omaha/handEvaluator.ts": "Evaluates Omaha hands by checking all valid 5‑card combinations and ranks hands for winner determination.",
  "frontend/src/games/omaha/OmahaCommunityBoard.tsx": "Displays Omaha community cards with reveal logic based on betting street and a fallback when cards are unavailable.",
  "frontend/src/games/omaha/types.ts": "Contains type definitions for Omaha cards, players, game state, and helper functions for suit colors and card text.",
  "frontend/src/games/session/quickPlaySession.ts": "Manages Spades and Omaha quick‑play sessions, initializing games and routing player and bot actions to the correct engine.",
  "frontend/src/games/spades/bots.ts": "Implements Spades bot bidding and card‑play logic, choosing legal plays and estimating bids from hand strength.",
  "frontend/src/games/spades/engine.ts": "Implements Spades game setup, deck creation, shuffling, dealing, bidding, and hand reset logic.",
  "frontend/src/games/spades/scoring.ts": "Defines scoring rules for Spades hands, target score checking, and winner determination.",
  "frontend/src/games/spades/types.ts": "Provides type definitions for Spades cards, players, tricks, penalties, and game state helpers.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries on changes.",
  "frontend/src/hooks/useActorWithRetry.ts": "Wraps useActor with connection/error tracking and retry state handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, providing identity state, login, and logout within a React context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user profiles, canister metadata, and Flexa deposit operations using the backend actor.",
  "frontend/src/hooks/useQuickPlaySession.ts": "React hook managing quick-play game sessions, handling bot actions, bids, and card plays for Spades and Omaha. Includes safety caps and state synchronization with async processing.",
  "frontend/src/hooks/useWalletConnect.ts": "Manages WalletConnect session lifecycle including initialization, connection flow, approval handling, errors, and cancellation. Syncs state for UI and exposes connect, disconnect, and balance functions.",
  "frontend/src/hooks/useWeb3Wallet.ts": "Unified Web3 wallet manager combining injected wallets, WalletConnect, and guest wallets. Tracks connection state, balances, chain ID, and handles network switching and wallet detection.",
  "frontend/src/index.css": "Tailwind-based global styles defining color themes, dark mode, gradients, scrollbars, and card UI animations.",
  "frontend/src/lib/walletconnect.ts": "Custom WalletConnect client wrapper handling initialization, session restoration, connection, and error mapping using SignClient.",
  "frontend/src/lib/web3modal.ts": "Placeholder config for Web3Modal with Base chain metadata and static wallet metadata.",
  "frontend/src/main.tsx": "React entry point rendering App with React Query and Internet Identity providers.",
  "frontend/src/types/qrcode.d.ts": "Empty TypeScript declaration file for QR code typing.",
  "frontend/src/utils/ethFormat.ts": "Utility functions for safely parsing and formatting ETH values using BigInt and fixed decimal output.",
  "frontend/src/utils/icpLinks.ts": "Provides helpers to detect the current site origin, resolve the canister ID from multiple sources, build a public IC gateway URL, and copy text to the clipboard.",
  "frontend/src/utils/isEmbedded.ts": "Detects whether the app is running inside an iframe and provides a helper to open the current URL in a new tab.",
  "frontend/src/utils/sleep.ts": "Implements a simple promise-based sleep function for delaying actions.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including hash-based routing support and sessionStorage persistence.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending theme colors, layout, animations, and including typography, container queries, and animation plugins.",
  "project_state.json": "Describes project metadata, known issues, existing feature requests, and versioned state information for the Crypto Cards project."
}