{
  "kind": "build_request",
  "title": "Fix unresponsive Connect Wallet flow (WalletConnect modal, install prompt, and error feedback)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the WalletConnect connection path triggers visible UI feedback by rendering a WalletConnect modal whenever `useWeb3Wallet().showWalletConnectModal` is set to true, and allow the modal to be closed (which must set `showWalletConnectModal` back to false).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nothing happens when I press connect wallet"
        ]
      },
      "acceptanceCriteria": [
        "In Real mode, selecting “WalletConnect” from the Connect Wallet menu opens a modal on top of the app (not just a console log).",
        "Closing the modal (Cancel button or dialog close) hides it and does not leave the UI in a stuck loading state.",
        "No React console errors about missing providers/components when opening the modal."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure users see a clear install prompt when no injected wallet provider is detected by mounting `WalletInstallModal` at the app level so that `wallet.walletNotDetected` results in a visible modal instead of only setting state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nothing happens when I press connect wallet"
        ]
      },
      "acceptanceCriteria": [
        "On a browser without `window.ethereum`, selecting “Coinbase Wallet” or “MetaMask” from the Connect Wallet menu opens an “Install a Wallet” modal.",
        "Dismissing the install modal clears the install prompt state so it does not immediately re-open.",
        "The rest of the app remains usable after closing the install modal."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add user-facing error and progress feedback for wallet connections: when `wallet.connect(...)` fails or a request is pending/rejected, show an English toast and/or inline message and reflect `wallet.isConnecting` by disabling relevant connect UI elements and indicating connection is in progress.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nothing happens when I press connect wallet"
        ]
      },
      "acceptanceCriteria": [
        "If the user rejects the wallet request, the UI shows an English error message (e.g., via toast) without requiring opening the dev console.",
        "If a connection request is already pending, the UI informs the user to check their wallet app/extension.",
        "While connecting, the Connect Wallet menu items/buttons are disabled or otherwise clearly indicate a connection attempt is in progress.",
        "Successful connect results in the header showing the shortened address and the connected wallet label (as currently designed)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (compose them only).",
    "Do not edit any files listed in `frontend.immutablePaths` in SYSTEM_CONTEXT.",
    "Backend remains single-actor; no backend changes are required for this wallet-connect UI fix."
  ],
  "nonGoals": [
    "Implementing the real WalletConnect SDK / generating real WalletConnect URIs.",
    "Adding third-party authentication providers or external wallet/payment integrations beyond the current in-app UI flow."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}