{
  "kind": "build_request",
  "title": "Fix real wallet connection flow (non-guest) and improve diagnostics",
  "projectName": "Crypto Cards",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-4",
      "text": "Fix injected (browser) wallet connection so that a non-guest wallet can reliably connect when window.ethereum is present but cannot be identified as MetaMask or Coinbase Wallet (e.g., missing isMetaMask/isCoinbaseWallet flags, multiple providers, or other injected wallets).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The guest wallet works but not the real wallet"
        ]
      },
      "acceptanceCriteria": [
        "When a browser-injected provider exists (window.ethereum is defined) but wallet type detection returns null, the wallet picker still offers a connect option for an injected wallet (user-facing label in English).",
        "Selecting the injected wallet option triggers the same connect flow (eth_requestAccounts, eth_chainId, balance fetch) and results in wallet.isConnected === true with an address displayed in the Wallet section.",
        "If eth_requestAccounts is rejected or fails, the UI shows a clear error message and returns to a non-stuck state (wallet.isConnecting becomes false, user can retry)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Make the wallet picker reflect the actual set of usable wallet connection options and provide clear guidance when a wallet is installed but not detected as MetaMask/Coinbase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The guest wallet works but not the real wallet"
        ]
      },
      "acceptanceCriteria": [
        "If window.ethereum exists but detectWalletType() returns null, show a wallet picker button (e.g., \"Browser Wallet\") instead of only showing WalletConnect/Guest.",
        "If no injected provider exists, keep the existing behavior (WalletConnect + Guest) and show the existing wallet-not-detected messaging when users attempt an injected connection.",
        "All wallet picker labels and error/help text are in English."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add user-visible diagnostics for non-guest wallet connection failures to make it obvious why the real wallet is not usable (e.g., wrong network, not transaction-ready, embedded/iframe limitations).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The guest wallet works but not the real wallet"
        ]
      },
      "acceptanceCriteria": [
        "When wallet.isConnected is true but wallet.isTransactionReady is false, show actionable guidance that helps the user complete authorization (and do not block retry attempts).",
        "When wallet.isConnected is true but wallet.isOnBaseNetwork is false, keep the existing \"Switch to Base\" action and ensure any switch errors are surfaced to the user (English).",
        "When connection fails, surface a short error summary to the user (already supported via wallet.error) and include a way to clear/dismiss and retry without refreshing."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep the backend as a single Motoko actor; no backend changes are required for this fix unless a frontend-blocking backend error is discovered during debugging."
  ],
  "nonGoals": [
    "Adding new wallet providers beyond injected wallets and the existing WalletConnect + Guest options.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Introducing external databases or non-IC storage for wallet state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}