{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Spades Quick Play: Play to 500 with multi-hand scoring",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "End Spades Quick Play only when a player reaches 500+ total points (not after one hand), with deterministic winner selection for multi-reach/ties.",
      "acceptanceCriteria": [
        "After completing a hand (13 tricks), the game does not automatically end unless at least one player has reached 500+ total points.",
        "The game-over state is triggered by reaching the 500-point target (not by simply completing 13 tricks).",
        "If multiple players reach 500+ at the end of the same hand, the winner is determined consistently (e.g., highest total points); ties are handled deterministically (e.g., shared winner label or a stable tie-break rule)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/games/spades/types.ts",
          "operation": "modify",
          "description": "Extend Spades player/state types to support multi-hand sessions (e.g., per-player persistent totalScore and per-hand handScore/lastHandScore) and any additional fields needed to represent game-over-by-score logic."
        },
        {
          "path": "frontend/src/games/spades/engine.ts",
          "operation": "modify",
          "description": "Update hand-completion logic so that after 13 tricks the engine finalizes the hand, updates persistent totals, checks for the 500-point win condition, and only sets gameOver when a player has reached/exceeded 500. If multiple players are 500+ after the same hand, select winner deterministically (e.g., highest totalScore; stable tie-break by fixed player order or id)."
        },
        {
          "path": "frontend/src/components/QuickPlayGame.tsx",
          "operation": "modify",
          "description": "Adjust Spades game-over messaging to reflect score-target completion (winner by total points) rather than winner-by-tricks in a single hand, including deterministic tie handling display if applicable."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement Spades hand scoring and carry total scores across hands in the same Quick Play session, showing a 500-point target in the UI and automatically starting new hands until the target is reached.",
      "acceptanceCriteria": [
        "At the end of each hand, each player receives a hand score derived from their bid and tricks won, and that hand score is added to their persistent total score for the session.",
        "The UI displays each player’s total score (accumulated across hands) and clearly indicates the win target as 500 points.",
        "A new hand is started automatically (fresh deal, reset tricks/bids/spadesBroken/current trick) when a hand ends and no player has yet reached 500 points.",
        "User-facing labels related to the scoring target are in English (e.g., \"Target: 500\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/games/spades/scoring.ts",
          "operation": "create",
          "description": "Add a focused scoring helper for Spades that computes a player's hand score from bid and tricks won (and any simple nil handling if bid=0), and exposes constants like TARGET_SCORE=500 for reuse across engine/UI."
        },
        {
          "path": "frontend/src/games/spades/types.ts",
          "operation": "modify",
          "description": "Add/adjust fields required to store per-hand computed scores and persistent per-player total scores across hands in a single Quick Play session."
        },
        {
          "path": "frontend/src/games/spades/engine.ts",
          "operation": "modify",
          "description": "Implement end-of-hand scoring: when the 13th trick completes, compute each player's hand score, add it to their persistent total score, store the last hand score for UI, and if no player is at 500+ start a new hand automatically (fresh shuffled deal; reset bids, tricksWon, spadesBroken, currentTrick/completedTricks, and bidding phase flags) while keeping total scores."
        },
        {
          "path": "frontend/src/components/QuickPlayGame.tsx",
          "operation": "modify",
          "description": "Update the Spades in-game UI to display each player's persistent total score and show the target clearly (English label such as \"Target: 500\"). Enhance the scoreboard to include totals (and optionally the most recent hand score) while preserving existing reneging indicators."
        }
      ]
    }
  ]
}