{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix injected wallet connection fallback + improve wallet picker and diagnostics",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Support a generic browser-injected wallet connect flow when window.ethereum exists but MetaMask/Coinbase cannot be identified, including multi-provider scenarios and robust error recovery.",
      "acceptanceCriteria": [
        "When a browser-injected provider exists (window.ethereum is defined) but wallet type detection returns null, the wallet picker still offers a connect option for an injected wallet (user-facing label in English).",
        "Selecting the injected wallet option triggers the same connect flow (eth_requestAccounts, eth_chainId, balance fetch) and results in wallet.isConnected === true with an address displayed in the Wallet section.",
        "If eth_requestAccounts is rejected or fails, the UI shows a clear error message and returns to a non-stuck state (wallet.isConnecting becomes false, user can retry)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWeb3Wallet.ts",
          "operation": "modify",
          "description": "Add a generic injected wallet option (e.g., 'injected') to the wallet type union and implement a resilient injected-provider selector that works when detection is null (including handling multiple injected providers). Ensure connect() runs the same injected flow for this generic option (eth_requestAccounts, eth_chainId, balance fetch) and that all failures (including user rejection) reliably reset isConnecting=false, preserve a clear English error in wallet.error, and allow immediate retries without refresh."
        },
        {
          "path": "frontend/src/contexts/Web3WalletContext.tsx",
          "operation": "modify",
          "description": "Update context typing to include the new generic injected wallet option and ensure the provider exposes it consistently to the UI."
        },
        {
          "path": "frontend/src/components/WalletPickerModal.tsx",
          "operation": "modify",
          "description": "Extend the picker to support selecting the new generic injected wallet option and ensure it triggers the same connect flow and closes appropriately (matching existing injected behavior). All user-facing labels must remain in English."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make the wallet picker reflect usable options, including a 'Browser Wallet' option when an injected provider exists but is not MetaMask/Coinbase, while keeping existing behavior when no injected provider exists.",
      "acceptanceCriteria": [
        "If window.ethereum exists but detectWalletType() returns null, show a wallet picker button (e.g., \"Browser Wallet\") instead of only showing WalletConnect/Guest.",
        "If no injected provider exists, keep the existing behavior (WalletConnect + Guest) and show the existing wallet-not-detected messaging when users attempt an injected connection.",
        "All wallet picker labels and error/help text are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWeb3Wallet.ts",
          "operation": "modify",
          "description": "Adjust availableWallets derivation so that when window.ethereum exists and detectWalletType() is null, a generic injected option is included (and surfaced to the picker). Ensure no injected option is presented when no injected provider exists, preserving WalletConnect + Guest behavior."
        },
        {
          "path": "frontend/src/components/WalletPickerModal.tsx",
          "operation": "modify",
          "description": "Update wallet option rendering so that when the generic injected option is available it appears with an English label such as \"Browser Wallet\" (and appropriate icon), while retaining existing options for WalletConnect and Guest. Ensure the UI does not imply MetaMask/Coinbase when the wallet is unknown."
        },
        {
          "path": "frontend/src/components/WalletInstallModal.tsx",
          "operation": "modify",
          "description": "Refine the English guidance text so that it remains accurate with the new generic injected path (e.g., clarify that any browser wallet extension may work, while still listing MetaMask/Coinbase as examples). Keep behavior consistent with walletNotDetected dismissal."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Add clear user-visible diagnostics and recovery actions for non-guest wallet connection problems (transaction readiness, wrong network, embedded limitations, and connection errors).",
      "acceptanceCriteria": [
        "When wallet.isConnected is true but wallet.isTransactionReady is false, show actionable guidance that helps the user complete authorization (and do not block retry attempts).",
        "When wallet.isConnected is true but wallet.isOnBaseNetwork is false, keep the existing \"Switch to Base\" action and ensure any switch errors are surfaced to the user (English).",
        "When connection fails, surface a short error summary to the user (already supported via wallet.error) and include a way to clear/dismiss and retry without refreshing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWeb3Wallet.ts",
          "operation": "modify",
          "description": "Improve error propagation and state for injected network switching and readiness: ensure switchToBase() surfaces failures in wallet.error (English) and does not leave stale connecting state. Optionally add a lightweight retry helper for injected connections (reusing connect(selectedWallet)) without requiring a full page refresh."
        },
        {
          "path": "frontend/src/components/WalletSection.tsx",
          "operation": "modify",
          "description": "Add user-visible diagnostics panels for: (1) connected but not transaction-ready (actionable steps + a retry button that re-attempts connection/readiness checks without blocking), (2) connected but wrong network (keep \"Switch to Base\" and display switch errors from wallet.error), and (3) general connection errors (show wallet.error summary with a dismiss/clear action and a retry path). Incorporate embedded/iframe guidance using frontend/src/utils/isEmbedded.ts (e.g., suggest opening in a new tab when embedded limitations may apply). Ensure all text is in English."
        },
        {
          "path": "frontend/src/components/WalletPickerModal.tsx",
          "operation": "modify",
          "description": "When wallet.error is present, add an explicit dismiss/clear control (English) so the user can clear the message and retry a connection attempt without refreshing. Ensure errors from injected connect failures (including eth_requestAccounts rejection) remain visible and do not trap the UI in a connecting state."
        }
      ]
    }
  ]
}