{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Ensure Live publish verification UI correctly surfaces public ICP link and refreshed build metadata",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Improve frontend live-publish verification so Admin Settings reliably shows the public ic0.app link and allows confirming refreshed canister build metadata after Version 163 is published.",
      "acceptanceCriteria": [
        "After publish, the app loads successfully from https://<canister-id>.ic0.app in a new browser session.",
        "In the Admin Settings area, the Public ICP Link is available and points to https://<canister-id>.ic0.app (not empty/unavailable).",
        "Backend deployment metadata (e.g., build time and/or build identifier if provided) reflects the newly published Version 163 build when refreshed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/icpLinks.ts",
          "operation": "modify",
          "description": "Harden canister-id detection so getPublicIcpLink() can be computed reliably across draft/preview and live builds (e.g., support more host patterns and common build/runtime-provided canister id sources), while still always returning an ic0.app URL when a canister id is known."
        },
        {
          "path": "frontend/src/components/LivePublishStatus.tsx",
          "operation": "modify",
          "description": "Refine LivePublishStatus to use the improved ic0.app link computation, reduce false 'not available' states, and ensure the 'Refresh' action reliably re-requests build metadata so admins can confirm the newly published Version 163 build metadata update after deployment."
        },
        {
          "path": "frontend/src/components/AdminSettings.tsx",
          "operation": "modify",
          "description": "Ensure the Admin Settings 'Live Deployment Status' area clearly surfaces the 'Public ICP Link' value from LivePublishStatus as a first-class admin verification item (no new admin features; only presentation/clarity changes)."
        }
      ]
    }
  ]
}